app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @current_food = Food.find(params[:id])

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Yeast"], ["measurement_unit", "grams"], ["price", 43], ["quantity", 22], ["user_id", 1], ["created_at", "2023-06-29 13:47:06.410568"], ["updated_at", "2023-06-29 13:47:06.410568"]]
---
  def create
    @food = Food.new(food_params.merge(users_id: current_user.id))

    if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 3]]
---
  def destroy
    @food = Food.find(params[:id])
    @food.destroy