app/controllers/food_recipes_controller.rb

  def index
    @foods = Food.joins(:food_recipes).where(user_id: current_user.id)
    @food_count = @foods.length
    @food_cost = @foods.sum(:price)
---
SELECT "foods".* FROM "foods" INNER JOIN "food_recipes" ON "food_recipes"."food_id" = "foods"."id" WHERE "foods"."user_id" = $1  [["user_id", 1]]
SELECT "food_recipes".* FROM "food_recipes"
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "foods".* FROM "foods"
SELECT SUM("foods"."price") FROM "foods" INNER JOIN "food_recipes" ON "food_recipes"."food_id" = "foods"."id" WHERE "foods"."user_id" = $1  [["user_id", 1]]

  def create
    @food = Food.find_by(name: params[:category])
    @food_id = @food.id
    @food_recipe = FoodRecipe.new(recipe_id: params[:id], food_id: @food_id,
                                  quantity: food_recipe_params[:quantity].to_i)

    if @food_recipe.save
---
SELECT "foods".* FROM "foods" WHERE "foods"."name" = $1 LIMIT $2  [["name", "Wheat"], ["LIMIT", 1]]
INSERT INTO "food_recipes" ("recipe_id", "food_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["recipe_id", 3], ["food_id", 1], ["quantity", nil], ["created_at", "2023-06-30 09:50:06.210964"], ["updated_at", "2023-06-30 09:50:06.210964"]]

  def set_food_recipe
    @food_all = Food.where(user_id: current_user.id)
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 2]]