app/controllers/public_recipes_controller.rb

  def index
    @recipes = Recipe.where('public = ? OR user_id = ?', true, current_user.id)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]