app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
---
  def index
    @recipes = Recipe.where(user_id: current_user.id)

SELECT "foods".* FROM "foods" LEFT OUTER JOIN "food_recipes" ON "food_recipes"."food_id" = "foods"."id" WHERE "food_recipes"."recipe_id" = $1 AND "foods"."user_id" = $2 LIMIT $3  [["recipe_id", 5], ["user_id", 2], ["LIMIT", 1]]
---
  def show
    @foods = Food.joins(:food_recipes).where(food_recipes: { recipe_id: params[:id] }).where(user_id: current_user.id)

INSERT INTO "recipes" ("name", "description", "preparation_time", "cooking_time", "public", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @create_recipe = recipe_params.merge(user_id: current_user.id)
    # @modify_public = params[:recipe][:public] = recipe_params[:public].to_i.zero? ? false : true
    @recipe = Recipe.new(recipe_params.merge(user_id: current_user.id))
    @recipe[:public] = @recipe[:public] != '0'
    respond_to do |format|
      if @recipe.save

UPDATE "food_recipes" SET "recipe_id" = $1 WHERE "food_recipes"."recipe_id" = $2  [["recipe_id", nil], ["recipe_id", 1]]
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)

SELECT "food_recipes".* FROM "food_recipes" WHERE "food_recipes"."recipe_id" = $1 LIMIT $2  [["recipe_id", 8], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]
DELETE FROM "food_recipes" WHERE "food_recipes"."id" = $1  [["id", 1]]
---
  def destroy
    @food_recipe = FoodRecipe.find_by(recipe_id: @recipe.id)
    @food_recipe&.destroy
    @recipe.destroy!

SELECT "food_recipes".* FROM "food_recipes" WHERE "food_recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "food_recipes" SET "recipe_id" = $1 WHERE "food_recipes"."recipe_id" = $2  [["recipe_id", nil], ["recipe_id", 8]]
UPDATE "recipes" SET "public" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["public", true], ["updated_at", "2023-06-30 14:24:12.372796"], ["id", 2]]
---
  def toggle_action
    @recipe = Recipe.find(params[:id])
    @toggle_status = @recipe[:public]
    @toggle_status = !@toggle_status
    @recipe[:public] = @toggle_status
    return unless @recipe.save

SELECT "food_recipes".* FROM "food_recipes" WHERE "food_recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def set_recipe
    @recipe = Recipe.find(params[:id])